app/views/posts/index.html.erb

        <strong>Author:</strong> <%= post.user.username %> |
        <strong>Comments:</strong> <%= link_to post.comments.count, post_path(post) %> |
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]