app/views/posts/show.html.erb


<h2>Comments (<%= @post.comments.count %>)</h2>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY "comments"."created_at" ASC  [["post_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]