app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["content", "comment!"], ["user_id", 1], ["post_id", 5], ["created_at", "2024-11-04 19:25:17.203838"], ["updated_at", "2024-11-04 19:25:17.203838"]]
---
  def create
    @comment = @post.comments.build(comment_params)
    @comment.user = current_user
    if @comment.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def set_post
    @post = Post.find_by(id: params[:post_id])