app/controllers/posts_controller.rb

  def show
    @comments = @post.comments.order(created_at: :asc)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY "comments"."created_at" ASC  [["post_id", 2]]

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["content", "hihihihi"], ["user_id", 1], ["created_at", "2024-11-04 17:24:18.303320"], ["updated_at", "2024-11-04 17:24:18.303320"]]

  def set_post
    @post = Post.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]