app/controllers/sessions_controller.rb

  def create
    username = params[:username].strip
    if username.blank? || username.length < 3
      flash[:alert] = "Username must be at least 3 characters."
      render :new
      return
    end

    user = User.find_or_create_by(username: username)
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["username", "test"], ["created_at", "2024-11-04 17:22:56.873851"], ["updated_at", "2024-11-04 17:22:56.873851"]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "test"], ["LIMIT", 1]]